#### Terraform Plan 📖
```module.api.data.archive_file.create-function-zip: Reading...
module.api.data.archive_file.delete-function-zip: Reading...
module.layer.data.archive_file.layer_zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Reading...
module.api.data.archive_file.update-function-zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Read complete after 0s [id=dedc2b0dd5cba1951543f217e8e67f5917e1cddc]
module.api.data.archive_file.delete-function-zip: Read complete after 0s [id=1012d83b1cdbb66c25d8325819341f48a8cca17a]
module.api.data.archive_file.create-function-zip: Read complete after 0s [id=ede30d944c1defe12a7bb7db4f467f3250f78cf8]
module.api.data.archive_file.update-function-zip: Read complete after 0s [id=9046ada8f333d203d99daabe9317d14516f62e81]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Reading...
module.api.aws_cloudwatch_log_group.throwtrash-alarm-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm]
data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Reading...
module.api.aws_api_gateway_api_key.api-key-dev: Refreshing state... [id=mtw89qlbs2]
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.alarm-trigger.aws_cloudwatch_log_group.throwtrash-alarm-trigger-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-trigger]
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api-gateway-prod-stage[0].aws_api_gateway_domain_name.api-domain-name: Refreshing state... [id=alarm.mythrowaway.net]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Read complete after 0s [id=52247394]
module.api.data.aws_region.current: Reading...
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=ylt5sxzsod]
module.api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.alarm-trigger.data.aws_region.current: Reading...
module.alarm-trigger.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.aws_dynamodb_table.throwtrash-alarm-table: Refreshing state... [id=throwtrash-alarm]
data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api.aws_scheduler_schedule_group.throwtrash-alarm-schedule-group: Refreshing state... [id=throwtrash-alarm-schedule-group]
module.api.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api.aws_iam_role.throwtrash-alarm-scheduler-role: Refreshing state... [id=throwtrash-alarm-scheduler-role]
module.alarm-trigger.aws_iam_role.throwtrash-alarm-trigger-lambda-role: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role]
module.api.aws_iam_role.throwtrash-alarm-lambda-role: Refreshing state... [id=throwtrash-alarm-lambda-role]
module.api-gateway-prod-stage[0].aws_route53_record.route53-record: Refreshing state... [id=Z5UYE2IX50J9A_alarm.mythrowaway.net_A]
module.api.aws_api_gateway_resource.api-resource-delete: Refreshing state... [id=nkks0s]
module.api.aws_api_gateway_resource.api-resource-create: Refreshing state... [id=wipuw0]
module.api.aws_api_gateway_resource.api-resource-update: Refreshing state... [id=k5ktnr]
module.api.aws_api_gateway_method.api-method-put: Refreshing state... [id=agm-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_api_gateway_method.api-method-post: Refreshing state... [id=agm-ylt5sxzsod-wipuw0-POST]
module.api.aws_api_gateway_method.api-method-delete: Refreshing state... [id=agm-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_iam_policy.throwtrash-alarm-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-lambda-policy]
module.api-gateway-prod-stage[0].aws_api_gateway_deployment.api-deployment-prod: Refreshing state... [id=uuaip0]
module.api.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-lambda-role-20240429132809078300000002]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v1: Refreshing state... [id=ags-ylt5sxzsod-v1]
module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping: Refreshing state... [id=alarm.mythrowaway.net/]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v1: Refreshing state... [id=u56dai]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.layer.data.archive_file.layer_zip: Read complete after 3s [id=9cf49c0537aa4472ad9b7a59d3895b487e00ec43]
module.layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:23]
module.api.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete]
module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda: Refreshing state... [id=throwtrash-alarm-trigger]
module.api.aws_lambda_alias.throwtrash-delete-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:dev]
module.api.aws_api_gateway_integration.api-integration-delete: Refreshing state... [id=agi-ylt5sxzsod-nkks0s-DELETE]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:dev]
module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-trigger-lambda-policy]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0]: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod]
module.api.aws_iam_policy.throwtrash-alarm-scheduler-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-scheduler-policy]
module.api.aws_lambda_function.throwtrash-alarm-update-lambda: Refreshing state... [id=throwtrash-alarm-update]
module.api.aws_lambda_function.throwtrash-alarm-create-lambda: Refreshing state... [id=throwtrash-alarm-create]
module.api.aws_lambda_permission.throwtrash-delete-permission-apigw: Refreshing state... [id=terraform-20240429131802029300000004]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v1: Refreshing state... [id=terraform-20240502175438382900000001]
module.alarm-trigger.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role-20240429131751105100000002]
module.api.aws_iam_role_policy_attachment.scheduler-policy-attachment: Refreshing state... [id=throwtrash-alarm-scheduler-role-20240429131751028900000001]
module.api.aws_lambda_alias.throwtrash-update-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:dev]
module.api.aws_api_gateway_integration.api-integration-update: Refreshing state... [id=agi-ylt5sxzsod-k5ktnr-PUT]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1]
module.api.aws_lambda_alias.throwtrash-create-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:dev]
module.api.aws_api_gateway_integration.api-integration-create: Refreshing state... [id=agi-ylt5sxzsod-wipuw0-POST]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439070600000003]
module.api.aws_lambda_permission.throwtrash-update-permission-apigw: Refreshing state... [id=terraform-20240429132827320000000006]
module.api.aws_api_gateway_deployment.api-deployment-dev: Refreshing state... [id=78em6t]
module.api.aws_lambda_permission.throwtrash-create-permission-apigw: Refreshing state... [id=terraform-20240429132817896500000004]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439018500000002]
module.api.aws_api_gateway_stage.api-stage-dev: Refreshing state... [id=ags-ylt5sxzsod-dev]
module.api.aws_api_gateway_usage_plan.usage-plan-dev: Refreshing state... [id=4hwsh7]
module.api.aws_api_gateway_usage_plan_key.api-plan-key-dev: Refreshing state... [id=mtw89qlbs2]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda has changed
  ~ resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
        id                             = "throwtrash-alarm-trigger"
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "10" -> "11"
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda has changed
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete"
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "10" -> "11"
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy will be updated in-place
  ~ resource "aws_iam_policy" "throwtrash-alarm-trigger-lambda-policy" {
        id          = "arn:aws:iam::188970983837:policy/throwtrash-alarm-trigger-lambda-policy"
        name        = "throwtrash-alarm-trigger-lambda-policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:dynamodb:ap-northeast-1:188970983837:table/TrashSchedule",
                          + "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-shared-schedule",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "logs:CreateLogStream",
                            "logs:PutLogEvents",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:logs:ap-northeast-1:188970983837:log-group:/aws/lambda/throwtrash-alarm-trigger:*",
                        ]
                        Sid      = "CloudWatchPolicy"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
        # (6 unchanged attributes hidden)
    }

  # module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0] will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-trigger-prod" {
      ~ function_version = "10" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod"
        name             = "prod"
        # (4 unchanged attributes hidden)
    }

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
        id                             = "throwtrash-alarm-trigger"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:11/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "11" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-create-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-create-lambda" {
        id                             = "throwtrash-alarm-create"
      ~ layers                         = [
          ~ "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:22" -> "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:23",
        ]
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:9/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "9" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:11/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "11" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-update-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-update-lambda" {
        id                             = "throwtrash-alarm-update"
      ~ layers                         = [
          ~ "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:22" -> "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:23",
        ]
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:9/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "9" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-create-alias-v1" {
      ~ function_version = "7" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1"
        name             = "v1"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-delete-alias-v1" {
      ~ function_version = "10" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1"
        name             = "v1"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-update-alias-v1" {
      ~ function_version = "7" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1"
        name             = "v1"
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 9 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.```